
## Plan Result (account-delete-monitor-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/15687)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 6 to destroy.</code></pre>

* Create
  * aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32
  * aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197
* Delete
  * pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392
  * pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C
  * pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B
  * pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5
* Replace
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
* Move
  * aws_cloudwatch_log_group.accountdeletemonitor_eventtracker_lambda_loggroup_FBEFDD08 => aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0
  * aws_codedeploy_app.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeployapp_1EF789BA => aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0
  * aws_codedeploy_deployment_group.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeploymentgroup_B3D6CC7C => aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66
  * aws_dynamodb_table.accountdeletemonitor_eventtable_dynamodbtable_DA277224 => aws_dynamodb_table.event-table_dynamodb_table_49BD839C
  * aws_iam_policy.accountdeletemonitor_EventTrackerlambdadynamopolicy_79C186FE => aws_iam_policy.EventTracker-lambda-dynamo-policy
  * aws_iam_policy.accountdeletemonitor_eventtracker_lambda_executionpolicy_D4355D22 => aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0
  * aws_iam_policy.accountdeletemonitor_eventtracker_sqspolicy_4144A2F6 => aws_iam_policy.eventtracker_sqs-policy_32E8FFAA
  * aws_iam_role.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeployrole_5DE47462 => aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3
  * aws_iam_role.accountdeletemonitor_eventtracker_lambda_executionrole_F9DABED8 => aws_iam_role.eventtracker_lambda_execution-role_6AC27719
  * aws_iam_role_policy_attachment.accountdeletemonitor_EventTrackerexecutionrolepolicyattachment_A3608833 => aws_iam_role_policy_attachment.EventTracker-execution-role-policy-attachment
  * aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_executionrolepolicyattachment_E7F86C18 => aws_iam_role_policy_attachment.eventtracker_execution-role-policy-attachment_88191D7C
  * aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeploypolicyattachment_25DA19C6 => aws_iam_role_policy_attachment.eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD
  * aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_lambda_executionrolepolicyattachment_77CDEDA4 => aws_iam_role_policy_attachment.eventtracker_lambda_execution-role-policy-attachment_4A84019A
  * aws_lambda_alias.accountdeletemonitor_eventtracker_lambda_alias_53715695 => aws_lambda_alias.eventtracker_lambda_alias_63DC690A
  * aws_lambda_event_source_mapping.accountdeletemonitor_eventtracker_lambdaeventsourcemapping_CF99BB2B => aws_lambda_event_source_mapping.eventtracker_lambda_event_source_mapping_9B8B4F28
  * aws_lambda_function.accountdeletemonitor_eventtracker_lambda_827686FF => aws_lambda_function.eventtracker_lambda_2D56166D
  * aws_s3_bucket.accountdeletemonitor_eventtracker_lambda_codebucket_3A72C0E3 => aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311
  * aws_s3_bucket_public_access_block.accountdeletemonitor_eventtracker_lambda_codebucketpublicaccessblock_1A877CF9 => aws_s3_bucket_public_access_block.eventtracker_lambda_code-bucket-public-access-block_5C535663
  * aws_sns_topic.accountdeletemonitor_pagerduty_alarmcriticaltopic_2B2C4149 => aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.accountdeletemonitor_pagerduty_alarmnoncriticaltopic_8C1C98C5 => aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.accountdeletemonitor_UserEventTopicsnssubscription_110C320E => aws_sns_topic_subscription.UserEventTopic-sns-subscription
  * aws_sns_topic_subscription.accountdeletemonitor_UserMergeTopicsnssubscription_4173F1D8 => aws_sns_topic_subscription.UserMerge-Topic-sns-subscription
  * aws_sns_topic_subscription.accountdeletemonitor_pagerduty_alarmcriticalsubscription_8F185E56 => aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.accountdeletemonitor_pagerduty_alarmnoncriticalsubscription_6D302123 => aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * aws_sqs_queue.accountdeletemonitor_eventtracker_lambdasqsqueue_B426A0A6 => aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE
  * aws_sqs_queue.accountdeletemonitor_eventtracker_lambdasqsqueue_redrivesqsqueue_006B9D2C => aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55
  * aws_sqs_queue.accountdeletemonitor_snstopicdql_9F197074 => aws_sqs_queue.sns-topic-dql
  * aws_sqs_queue_policy.accountdeletemonitor_admsnsdlqpolicy_8ADA1C83 => aws_sqs_queue_policy.adm-sns-dlq-policy
  * aws_sqs_queue_policy.accountdeletemonitor_admsnssqspolicy_B903BC41 => aws_sqs_queue_policy.adm-sns-sqs-policy
  * pagerduty_service.accountdeletemonitor_pagerduty_pagerdutycritical_15CE57AC => pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.accountdeletemonitor_pagerduty_pagerdutynoncritical_2E782BA0 => pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.accountdeletemonitor_eventtracker_lambda_loggroup_FBEFDD08 has moved to aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0
    resource "aws_cloudwatch_log_group" "eventtracker_lambda_log-group_D52B53E0" {
        id                = "/aws/lambda/AccountDeleteMonitor-Prod-EventTracker-Function"
        name              = "/aws/lambda/AccountDeleteMonitor-Prod-EventTracker-Function"
        tags              = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_app.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeployapp_1EF789BA has moved to aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0
    resource "aws_codedeploy_app" "eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0" {
        id               = "f2e37747-90fd-49c3-9e29-17228b6d477e:AccountDeleteMonitor-Prod-EventTracker-Lambda"
        name             = "AccountDeleteMonitor-Prod-EventTracker-Lambda"
        tags             = {}
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeploymentgroup_B3D6CC7C has moved to aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66
    resource "aws_codedeploy_deployment_group" "eventtracker_lambda-code-deploy_code-deployment-group_C430DA66" {
        id                          = "ad83bedb-b455-45c9-a7c8-6c6cff2bde46"
        tags                        = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_dynamodb_table.accountdeletemonitor_eventtable_dynamodbtable_DA277224 has moved to aws_dynamodb_table.event-table_dynamodb_table_49BD839C
    resource "aws_dynamodb_table" "event-table_dynamodb_table_49BD839C" {
        id                          = "ADM-Prod-event-table"
        name                        = "ADM-Prod-event-table"
        tags                        = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_policy.accountdeletemonitor_EventTrackerlambdadynamopolicy_79C186FE has moved to aws_iam_policy.EventTracker-lambda-dynamo-policy
    resource "aws_iam_policy" "EventTracker-lambda-dynamo-policy" {
        id        = "arn:aws:iam::996905175585:policy/account-delete-monitor-EventTracker-DynamoLambdaPolicy"
        name      = "account-delete-monitor-EventTracker-DynamoLambdaPolicy"
        tags      = {}
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.accountdeletemonitor_eventtracker_lambda_executionpolicy_D4355D22 has moved to aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0
    resource "aws_iam_policy" "eventtracker_lambda_execution-policy_A74ACAF0" {
        id        = "arn:aws:iam::996905175585:policy/AccountDeleteMonitor-Prod-EventTracker-ExecutionRolePolicy"
        name      = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRolePolicy"
        tags      = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.accountdeletemonitor_eventtracker_sqspolicy_4144A2F6 has moved to aws_iam_policy.eventtracker_sqs-policy_32E8FFAA
    resource "aws_iam_policy" "eventtracker_sqs-policy_32E8FFAA" {
        id        = "arn:aws:iam::996905175585:policy/AccountDeleteMonitor-Prod-EventTracker-LambdaSQSPolicy"
        name      = "AccountDeleteMonitor-Prod-EventTracker-LambdaSQSPolicy"
        tags      = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeployrole_5DE47462 has moved to aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3
    resource "aws_iam_role" "eventtracker_lambda-code-deploy_code-deploy-role_761181E3" {
        id                    = "AccountDeleteMonitor-Prod-EventTracker-CodeDeployRole"
        name                  = "AccountDeleteMonitor-Prod-EventTracker-CodeDeployRole"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.accountdeletemonitor_eventtracker_lambda_executionrole_F9DABED8 has moved to aws_iam_role.eventtracker_lambda_execution-role_6AC27719
    resource "aws_iam_role" "eventtracker_lambda_execution-role_6AC27719" {
        id                    = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRole"
        name                  = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRole"
        tags                  = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_EventTrackerexecutionrolepolicyattachment_A3608833 has moved to aws_iam_role_policy_attachment.EventTracker-execution-role-policy-attachment
    resource "aws_iam_role_policy_attachment" "EventTracker-execution-role-policy-attachment" {
        id         = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRole-20220809170003180500000002"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_executionrolepolicyattachment_E7F86C18 has moved to aws_iam_role_policy_attachment.eventtracker_execution-role-policy-attachment_88191D7C
    resource "aws_iam_role_policy_attachment" "eventtracker_execution-role-policy-attachment_88191D7C" {
        id         = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRole-20220809170003314500000004"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_lambdacodedeploy_codedeploypolicyattachment_25DA19C6 has moved to aws_iam_role_policy_attachment.eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD
    resource "aws_iam_role_policy_attachment" "eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD" {
        id         = "AccountDeleteMonitor-Prod-EventTracker-CodeDeployRole-20220809170003154300000001"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.accountdeletemonitor_eventtracker_lambda_executionrolepolicyattachment_77CDEDA4 has moved to aws_iam_role_policy_attachment.eventtracker_lambda_execution-role-policy-attachment_4A84019A
    resource "aws_iam_role_policy_attachment" "eventtracker_lambda_execution-role-policy-attachment_4A84019A" {
        id         = "AccountDeleteMonitor-Prod-EventTracker-ExecutionRole-20220809170003180900000003"
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_alias.accountdeletemonitor_eventtracker_lambda_alias_53715695 has moved to aws_lambda_alias.eventtracker_lambda_alias_63DC690A
    resource "aws_lambda_alias" "eventtracker_lambda_alias_63DC690A" {
        id               = "arn:aws:lambda:us-east-1:996905175585:function:AccountDeleteMonitor-Prod-EventTracker-Function:DEPLOYED"
        name             = "DEPLOYED"
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_event_source_mapping.accountdeletemonitor_eventtracker_lambdaeventsourcemapping_CF99BB2B has moved to aws_lambda_event_source_mapping.eventtracker_lambda_event_source_mapping_9B8B4F28
    resource "aws_lambda_event_source_mapping" "eventtracker_lambda_event_source_mapping_9B8B4F28" {
        id                                 = "8d2bbd17-a01e-4b17-a5c6-b1d39d964c57"
        # (18 unchanged attributes hidden)
    }

  # aws_lambda_function.accountdeletemonitor_eventtracker_lambda_827686FF has moved to aws_lambda_function.eventtracker_lambda_2D56166D
    resource "aws_lambda_function" "eventtracker_lambda_2D56166D" {
        id                             = "AccountDeleteMonitor-Prod-EventTracker-Function"
        tags                           = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (22 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket.accountdeletemonitor_eventtracker_lambda_codebucket_3A72C0E3 has moved to aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311
    resource "aws_s3_bucket" "eventtracker_lambda_code-bucket_E2F7C311" {
        id                          = "pocket-accountdeletemonitor-prod-eventtracker"
        tags                        = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32 will be created
  + resource "aws_s3_bucket_acl" "eventtracker_lambda_code-bucket-acl_94F01E32" {
      + acl    = "private"
      + bucket = "pocket-accountdeletemonitor-prod-eventtracker"
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91 will be created
  + resource "aws_s3_bucket_ownership_controls" "eventtracker_lambda_code-bucket-ownership-controls_AC55EF91" {
      + bucket = "pocket-accountdeletemonitor-prod-eventtracker"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_public_access_block.accountdeletemonitor_eventtracker_lambda_codebucketpublicaccessblock_1A877CF9 has moved to aws_s3_bucket_public_access_block.eventtracker_lambda_code-bucket-public-access-block_5C535663
    resource "aws_s3_bucket_public_access_block" "eventtracker_lambda_code-bucket-public-access-block_5C535663" {
        id                      = "pocket-accountdeletemonitor-prod-eventtracker"
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic.accountdeletemonitor_pagerduty_alarmcriticaltopic_2B2C4149 has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Critical"
        name                                     = "AccountDeleteMonitor-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.accountdeletemonitor_pagerduty_alarmnoncriticaltopic_8C1C98C5 has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "AccountDeleteMonitor-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.accountdeletemonitor_UserEventTopicsnssubscription_110C320E has moved to aws_sns_topic_subscription.UserEventTopic-sns-subscription
    resource "aws_sns_topic_subscription" "UserEventTopic-sns-subscription" {
        id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:90a94ef0-2351-48d4-9b4d-7259e72aee5a"
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.accountdeletemonitor_UserMergeTopicsnssubscription_4173F1D8 has moved to aws_sns_topic_subscription.UserMerge-Topic-sns-subscription
    resource "aws_sns_topic_subscription" "UserMerge-Topic-sns-subscription" {
        id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserMerge-Topic:11bb6521-6150-4d32-a0dd-9ef1528ff6c7"
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.accountdeletemonitor_pagerduty_alarmcriticalsubscription_8F185E56)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Critical:5884ee8b-2731-4ed1-8f8c-68822494f60d" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/9d3a4bc25e4d4d07d0b5a0585d5cab92/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Critical:5884ee8b-2731-4ed1-8f8c-68822494f60d" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.accountdeletemonitor_pagerduty_alarmnoncriticalsubscription_6D302123)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Non-Critical:e4a6eb50-6e5c-4497-87dd-1aa45680717a" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/a1a8c1ed93e84b00c0948bc41f28c80b/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:AccountDeleteMonitor-Prod-Infrastructure-Alarm-Non-Critical:e4a6eb50-6e5c-4497-87dd-1aa45680717a" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdeletemonitor_eventtracker_lambdasqsqueue_B426A0A6 has moved to aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE
    resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_3DFE90FE" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue"
        name                              = "AccountDeleteMonitor-Prod-EventTracker-Queue"
        tags                              = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdeletemonitor_eventtracker_lambdasqsqueue_redrivesqsqueue_006B9D2C has moved to aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55
    resource "aws_sqs_queue" "eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue-Deadletter"
        name                              = "AccountDeleteMonitor-Prod-EventTracker-Queue-Deadletter"
        tags                              = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdeletemonitor_snstopicdql_9F197074 has moved to aws_sqs_queue.sns-topic-dql
    resource "aws_sqs_queue" "sns-topic-dql" {
        id                                = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
        name                              = "AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
        tags                              = {
            "environment" = "Prod"
            "service"     = "AccountDeleteMonitor"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdeletemonitor_admsnsdlqpolicy_8ADA1C83 has moved to aws_sqs_queue_policy.adm-sns-dlq-policy
    resource "aws_sqs_queue_policy" "adm-sns-dlq-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-SNS-Topics-DLQ"
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdeletemonitor_admsnssqspolicy_B903BC41 has moved to aws_sqs_queue_policy.adm-sns-sqs-policy
    resource "aws_sqs_queue_policy" "adm-sns-sqs-policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/AccountDeleteMonitor-Prod-EventTracker-Queue"
        # (2 unchanged attributes hidden)
    }

  # pagerduty_service.accountdeletemonitor_pagerduty_pagerdutycritical_15CE57AC has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "PLVQO0G"
        name                    = "AccountDeleteMonitor-Prod-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.accountdeletemonitor_pagerduty_pagerdutynoncritical_2E782BA0 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "P2Z4NDZ"
        name                    = "AccountDeleteMonitor-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392 will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392 is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268critical_B71F6392" {
      - html_url        = "https://mozilla.pagerduty.com/services/PLVQO0G/integrations/PO8SNLY" -> null
      - id              = "PO8SNLY" -> null
      - integration_key = "9d3a4bc25e4d4d07d0b5a0585d5cab92" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PLVQO0G" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutycloudwatch12102268noncritical_4FB0EE9C" {
      - html_url        = "https://mozilla.pagerduty.com/services/P2Z4NDZ/integrations/PVU1PQO" -> null
      - id              = "PVU1PQO" -> null
      - integration_key = "a1a8c1ed93e84b00c0948bc41f28c80b" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "P2Z4NDZ" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDcritical_5595372B" {
      - html_url        = "https://mozilla.pagerduty.com/services/PLVQO0G/integrations/PRHDOAL" -> null
      - id              = "PRHDOAL" -> null
      - integration_key = "13d25273c058440cc0c7defe73e0e470" -> null
      - name            = "Sentry" -> null
      - service         = "PLVQO0G" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5 will be destroyed
  # (because pagerduty_service_integration.accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5 is not in configuration)
  - resource "pagerduty_service_integration" "accountdeletemonitor_pagerduty_accountdeletemonitorpagerdutysentry3E036BCDnoncritical_1EF451C5" {
      - html_url        = "https://mozilla.pagerduty.com/services/P2Z4NDZ/integrations/PZ3PQ2B" -> null
      - id              = "PZ3PQ2B" -> null
      - integration_key = "d7910f1a767d490cc05ecbb4c873e807" -> null
      - name            = "Sentry" -> null
      - service         = "P2Z4NDZ" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PLVQO0G"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "P2Z4NDZ"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PLVQO0G"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "P2Z4NDZ"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 8 to add, 0 to change, 6 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1144, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1144:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 1144, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 1144:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"39d00152-7241-42f3-9edd-e4220de0df87","JobName":"account-delete-monitor_infrastructure_plan_prod","PRNumber":82,"Program":"tfcmt","SHA1":"a52713dd78a1a502665fdeab74f0a14b21416c73","Target":"account-delete-monitor-cdk","Vars":{}} -->